[
  {
    "title": "🔹 New Tax Regime? Smarter Ways to Save",
    "content": "The new tax regime offers fewer deductions, but smart planning can still cut your tax. Here's how salaried and self-employed individuals can benefit.",
    "date": "2025-07-27"
  },
  {
    "title": "👉 NPS via Employer = Big Saver",
    "content": "• Up to 14% of basic salary contributed by employer is tax-free under Sec 80CCD(2)\n• 60% of corpus is tax-free on withdrawal at 60\n• Helps build long-term wealth, especially for retirement goals",
    "date": "2025-07-27"
  },
  {
    "title": "👉 Boost Your EPF Contributions",
    "content": "• You can contribute 12% of actual basic salary\n• Employer’s contribution remains tax-free\n• Good option for low-risk retirement planning",
    "date": "2025-07-27"
  },
  {
    "title": "👉 Tax-Smart Gifting to Parents",
    "content": "• Gift to non-earning parents → invest via their account\n• Interest income taxed in their hands (lower slab or NIL)\n• Not applicable for spouse/minor kids due to clubbing rules",
    "date": "2025-07-27"
  },
  {
    "title": "👉 For Consultants & Freelancers",
    "content": "• Use Sec 44ADA, declare 50% of gross receipts as income\n• No need to maintain books\n• Works well if receipts ≤ ₹75L",
    "date": "2025-07-27"
  },
  {
    "title": "👉 Still-Allowed Deductions",
    "content": "• Interest on loan for let-out property [Sec 24(b)]\n• Training/education expenses for professional upskilling\n• Some employer reimbursements",
    "date": "2025-07-27"
  },
  {
    "title": "CBDT Notifies Income Tax Return Forms for AY 2025-26",
    "content": "The Central Board of Direct Taxes (CBDT) has notified ITR-1 to ITR-7 forms for the Assessment Year 2025-26 with changes aligning to the new tax regime.",
    "date": "2025-07-27"
  },
  {
    "title": "GST Council Meeting: Key Takeaways",
    "content": "The 53rd GST Council meeting discussed rate rationalization and introduced clarifications on online gaming, food delivery, and insurance.",
    "date": "2025-07-26"
  },
  {
    "title": "RBI Increases Repo Rate by 25 Basis Points",
    "content": "The Reserve Bank of India raised the repo rate to 6.75% to curb inflation pressures amid rising crude oil prices.",
    "date": "2025-07-25"
  },
  {
    "title": "SEBI Mandates Additional Disclosures for Listed Companies",
    "content": "SEBI now requires quarterly ESG disclosures and enhanced board reporting starting Q3 FY2025.",
    "date": "2025-07-24"
  },
  {
    "title": "MCA Updates on LLP Filings",
    "content": "The Ministry of Corporate Affairs has extended the due date for LLP Form 11 to August 31, 2025.",
    "date": "2025-07-23"
  },
  {
  "title": "Comprehensive Guide to Claiming Tax Deductions Under the Old Regime for AY 2025-26",
  "content": "As taxpayers prepare for the upcoming tax filing season for Assessment Year 2025-26, it's crucial to understand the various deductions available under the old tax regime, particularly for those who have opted out of the new, simplified regime. This year, the focus remains on maximizing eligible exemptions to reduce taxable income. Key areas to review include Section 80C for investments in PPF, ELSS, life insurance premiums, and home loan principal repayments, which has a maximum limit of Rs. 1.5 lakhs. Additionally, Section 80D allows for deductions on health insurance premiums, with higher limits for senior citizens and parents. Interest paid on housing loans for self-occupied property can be claimed under Section 24(b) up to Rs. 2 lakhs, while rented properties have no upper limit on interest claims. Furthermore, contributions to the National Pension System (NPS) under Section 80CCD(1B) offer an additional deduction of Rs. 50,000, over and above the 80C limit. Taxpayers should also remember deductions for interest on education loans (Section 80E), donations to approved institutions (Section 80G), and specific medical treatments for dependent family members (Section 80DDB). Maintaining proper documentation, such as investment proofs, premium receipts, and loan statements, is paramount to avoid discrepancies during assessment. It's advisable to consult a tax professional to ensure all eligible deductions are claimed correctly and to navigate any recent minor amendments to the Income Tax Act for AY 2025-26 that might impact these claims.",
  "date": "2025-07-27"
}
]
