[
  {
    "title": "New Tax Regime? Smarter Ways to Save",
    "content": "The new tax regime offers fewer deductions, but smart planning can still cut your tax. Here's how salaried and self-employed individuals can benefit.",
    "date": "2025-07-27"
  },
  {
    "title": "NPS via Employer – A High-Impact Tax Saver",
    "content": "• Up to 14% of basic salary contributed by employer is tax-free under Sec 80CCD(2)\n• 60% of corpus is tax-free on withdrawal at age 60\n• Helps build long-term retirement wealth",
    "date": "2025-07-27"
  },
  {
    "title": "Boosting EPF Contributions for Safer Returns",
    "content": "• Employees can voluntarily contribute 12% of actual basic salary\n• Employer contributions remain tax-free\n• Reliable, low-risk retirement planning option",
    "date": "2025-07-27"
  },
  {
    "title": "Tax-Efficient Gifting to Parents",
    "content": "• Gifts to non-earning parents can be invested in their names\n• Income taxed in their slab (often lower or NIL)\n• Clubbing provisions do not apply (unlike for spouse or minor children)",
    "date": "2025-07-27"
  },
  {
    "title": "Section 44ADA Benefits for Consultants & Freelancers",
    "content": "• Declare 50% of gross receipts as presumptive income\n• No requirement to maintain books of accounts\n• Applicable if receipts are up to ₹75 lakhs",
    "date": "2025-07-27"
  },
  {
    "title": "Still-Allowed Deductions under New Regime",
    "content": "• Interest on loan for let-out property (Sec 24b)\n• Professional education/training expenses\n• Select employer reimbursements remain exempt",
    "date": "2025-07-27"
  },
  {
    "title": "CBDT Notifies Income Tax Return Forms for AY 2025-26",
    "content": "The Central Board of Direct Taxes (CBDT) has notified ITR-1 to ITR-7 for AY 2025-26, incorporating changes under the new tax regime.",
    "date": "2025-07-27"
  },
  {
    "title": "GST Council Meeting – Key Takeaways from 53rd Session",
    "content": "The 53rd GST Council meeting addressed rate rationalization and issued clarifications on online gaming, food delivery, and insurance sectors.",
    "date": "2025-07-26"
  },
  {
    "title": "RBI Hikes Repo Rate by 25 Basis Points",
    "content": "In an effort to control inflation, the RBI raised the repo rate to 6.75%, citing rising crude oil prices as a key pressure point.",
    "date": "2025-07-25"
  },
  {
    "title": "SEBI Introduces New ESG Disclosure Norms for Listed Companies",
    "content": "SEBI has mandated quarterly ESG disclosures and enhanced board reporting standards, effective from Q3 FY2025.",
    "date": "2025-07-24"
  },
  {
    "title": "MCA Extends LLP Form 11 Filing Deadline",
    "content": "The Ministry of Corporate Affairs (MCA) has extended the due date for LLP Form 11 filing to August 31, 2025.",
    "date": "2025-07-23"
  },
  {
    "title": "Guide to Claiming Tax Deductions Under Old Regime (AY 2025-26)",
    "content": "Detailed breakdown of deductions under the old tax regime, including Sections 80C, 80D, 80CCD(1B), 24(b), and 80E. Emphasis on documentation and compliance for optimal tax benefit.",
    "date": "2025-07-27"
  }
]
